alefragnani.bookmarks
alefragnani.project-manager
appler.pretty-json-preview
aykutsarac.jsoncrack-vscode
batisteo.vscode-django
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
connor4312.esbuild-problem-matchers
csstools.postcss
dart-code.dart-code
dart-code.flutter
databricks.sqltools-databricks-driver
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
donjayamanne.python-extension-pack
eliotvu.uc
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
flyfly6.terminal-in-status-bar
gerrnperl.outline-map
github.codespaces
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
gitlab.gitlab-workflow
golang.go
gydunhn.javascript-essentials
gydunhn.vsc-essentials-core

kevinrose.vsc-python-indent
kilocode.kilo-code
kokororin.vscode-phpfmt
koszti.snowflake-driver-for-sqltools

mechatroner.rainbow-csv
mekusuri.jsonl-tool
mermaidchart.vscode-mermaid-chart
meta.pyrefly
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-pack
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-ossdata.vscode-pgsql
ms-pyright.pyright
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.extension-test-runner
ms-vscode.hexeditor
ms-vscode.js-atom-grammar
ms-vscode.js-debug-nightly
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.vscode-node-azure-pack
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
mtxr.sqltools
mtxr.sqltools-driver-mssql
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
mtxr.sqltools-driver-sqlite
nilssoderman.ue-python
oracle.mysql-shell-for-vs-code
oracle.oracle-java
randomfractalsinc.duckdb-sql-tools
randomfractalsinc.vscode-data-preview
redhat.java
redhat.vscode-yaml
svelte.svelte-vscode
tomblind.scm-buttons-vscode
tombonnike.vscode-status-bar-format-toggle
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vstirbu.vscode-mermaid-preview
watson-devex.ibm-watsonx-orchestrate-agent-builder
whitphx.vscode-stlite
wholroyd.jinja
xdebug.php-debug
xdebug.php-pack
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zobo.php-intellisense